---
type: TransferredProjectStandardsEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# TransferredProjectStandardsEventArgs

`Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSelectedExternalItems | 2017.2 | `public IDictionary < Guid , string > GetSelectedExternalItems ()` |
| Property | SourceDocument | 2017.2 | `public Document SourceDocument { get ; }` |
| Property | TargetDocument | 2017.2 | `public Document TargetDocument { get ; }` |